; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	Star0 - direction
	Star3 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star2 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star4)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
)
(:goal (and
	(pointing satellite1 GroundStation6)
	(pointing satellite2 Planet17)
	(have_image Planet9 image0)
	(have_image Star10 image0)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 image0)
	(have_image Planet13 thermograph1)
	(have_image Planet14 thermograph1)
	(have_image Star15 thermograph1)
	(have_image Planet16 thermograph1)
	(have_image Planet17 image0)
	(have_image Planet18 image0)
))

)

; plan
1. (turn_to satellite2 groundstation5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite2 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite2 planet18 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet18)
   goals met: 0 of 12
5. (take_image satellite2 planet18 instrument4 image0)
   added: (have_image planet18 image0)
   goals met: 1 of 12
6. (turn_to satellite2 planet16 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet16)
   goals met: 1 of 12
7. (take_image satellite2 planet16 instrument4 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite2 planet14 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet14)
   goals met: 2 of 12
9. (take_image satellite2 planet14 instrument4 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 3 of 12
10. (turn_to satellite2 planet13 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet13)
   goals met: 3 of 12
11. (take_image satellite2 planet13 instrument4 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 4 of 12
12. (turn_to satellite2 phenomenon12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 12
13. (take_image satellite2 phenomenon12 instrument4 image0)
   added: (have_image phenomenon12 image0)
   goals met: 5 of 12
14. (turn_to satellite1 groundstation6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation6)
   goals met: 6 of 12
15. (turn_to satellite2 planet9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet9)
   goals met: 6 of 12
16. (take_image satellite2 planet9 instrument4 image0)
   added: (have_image planet9 image0)
   goals met: 7 of 12
17. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 7 of 12
18. (take_image satellite2 star10 instrument4 image0)
   added: (have_image star10 image0)
   goals met: 8 of 12
19. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 8 of 12
20. (take_image satellite2 star11 instrument4 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 9 of 12
21. (turn_to satellite2 star15 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star15)
   goals met: 9 of 12
22. (take_image satellite2 star15 instrument4 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 10 of 12
23. (turn_to satellite2 planet17 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 planet17)
   goals met: 11 of 12
24. (take_image satellite2 planet17 instrument4 image0)
   added: (have_image planet17 image0)
   goals met: 12 of 12
